**Do you need your VMs to be on for this lab?**  
YES (windows-vm)  

Within Azure Sentinel, browse to “Analytics” -> “Active Rules”
- Manually create the “TEST: Brute Force ATTEMPT - Windows” Rule

- SecurityEvent  
    | where EventID == 4625  
    | where TimeGenerated > ago(60m)  
    | summarize FailureCount = count() by AttackerIP = IpAddress, EventID, Activity, DestinationHostName = Computer  
    | where FailureCount >= 10

- Try to trigger it
- Delete the Rule when finished

We’re going to continue to work with logs from the VMs, so it may be a good idea to leave your VM’s on (unless you’re going to go to bed or something and want to maximize your savings)