Spreadsheet:[BEFORE AND AFTER](images/SOC%20Lab%201%20-%20BEFORE%20AND%20AFTER.xlsx)

Make sure all of the following queries/tables return something:
- SecurityEvent
- Syslog
- SecurityAlert
- SecurityIncident
- AzureNetworkAnalytics_CL

### Capturing Analytics in Honeypot
Let window-vm and linux-vm run for 24 hours.
- Afterwards, we will count all the alerts/etc that happened in the last 24 hours.

### Helpful KQL Queries

```
//Security Events (Windows VMs)
SecurityEvent
| where TimeGenerated >= ago(24h)
| count
```

```
//Syslog (Linux VMs)
Syslog
| where TimeGenerated >= ago(24h)
| count
```

```
//SecurityAlert (Microsoft Defender for Cloud)
SecurityAlert
| where DisplayName !startswith "CUSTOM" and DisplayName !startswith "TEST"
| where TimeGenerated >= ago(24h)
| count
```

```
//Security Incident (Sentinel Incidents)
SecurityIncident
| where TimeGenerated >= ago(24h)
| count
```

```
//NSG Inbound Malicious Flows Allowed
AzureNetworkAnalytics_CL 
| where FlowType_s == "MaliciousFlow" and AllowedInFlows_d > 0
| where TimeGenerated >= ago(24h)
| count
```

```
//TimeGenerated between certain dates (YYYY-DD-MMTHH:MM:SSZ)
| where TimeGenerated between (datetime(2025-02-23T12:00:00Z) .. datetime(2025-02-24T12:00:00Z))
| count
```
